snappyTestCirc/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    xMin
    {
        type            patch;
        nFaces          80;
        startFace       8560;
    }
    xMax
    {
        type            patch;
        nFaces          80;
        startFace       8640;
    }
    yMin
    {
        type            wall;
        nFaces          160;
        startFace       8720;
    }
    yMax
    {
        type            wall;
        nFaces          160;
        startFace       8880;
    }
    zMin
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          800;
        startFace       9040;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  zMax;
    }
    zMax
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          800;
        startFace       9840;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  zMin;
    }
)

// ************************************************************************* //
